app/Models/DataModel.php

    public function deleteData($id)
{
    $builder = $this->db->table("establishment");
    $builder->where('id', $id);
    $builder->delete();
---
DELETE FROM `establishment`
WHERE `id` = '15'

 public function updateData($data,$where)
    {
        $builder = $this->db->table("establishment");
        $builder->where($where);
        return $builder->update($data);
---
UPDATE `establishment` SET `id` = '17', `code` = '0909', `es_name` = 'TEST', `contact_number` = '233224', `address` = 'Lishment', `email_address` = 'estab@gmail.com', `auth_person` = 'w', `position` = 'asssss'
WHERE `id` = '17'